Repository: NEKOGET/ci4_user_guide_src_omegat
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: ########## Change Log ##########
ja: ########## 変更履歴 ##########

source: ################# Autoloading Files #################
ja: ################# ファイルのオートロード #################

source: ##################### Application Structure #####################
ja: ##################### アプリケーション 構造 #####################

source: ##################### CodeIgniter4 Overview #####################
ja: ##################### CodeIgniter4 概要 #####################

source: ###################### CodeIgniter User Guide ######################
ja: ###################### CodeIgniter ユーザーガイド ######################

source: ####################### CodeIgniter4 User Guide #######################
ja: ####################### CodeIgniter4 ユーザーガイド #######################

source: ####################### Welcome to CodeIgniter4 #######################
ja: ####################### CodeIgniter4へようこそ #######################

source: ######################### Generating the User Guide #########################
ja: ######################### Generating the ユーザーガイド #########################

source: ########################## Working With HTTP Requests ##########################
ja: ########################## HTTP リクエストを利用した作業 ##########################

source: ############################## CodeIgniter Internals Overview ##############################
ja: ############################## CodeIgniter 内部の概要 ##############################

source: ******* Welcome *******
ja: ******* ようこそ *******

source: ******** Tutorial ********
ja: ******** チュートリアル ********

source: ************ Installation ************
ja: ************ インストール ************

source: ************** General Topics **************
ja: ************** 一般的なトピック **************

source: *************** Style Guideline ***************
ja: *************** スタイルガイドライン ***************

source: **************** Helper Reference ****************
ja: **************** ヘルパー リファレンス ****************

source: ***************** Library Reference *****************
ja: ***************** ライブラリ リファレンス *****************

source: ****************** Database Reference ******************
ja: ****************** データーベースリファレンス ******************

source: ****************** Setup Instructions ******************
ja: ****************** セットアップ手順 ******************

source: ********************* CodeIgniter4 Overview ********************* ..
ja: ********************* CodeIgniter4 の概要 ********************* ..

source: *********************** Who is CodeIgniter For?
ja: *********************** CodeIgniterは、誰のためにありますか？

source: *************************** Contributing to CodeIgniter ***************************
ja: *************************** CodeIgniterへの貢献 ***************************

source: **Rewrite of the CodeIgniter framework**
ja: **CodeIgniterフレームワークのリライト**

source: - You are not interested in large-scale monolithic libraries like PEAR.
ja: - PEARのような大規模なモノリシックライブラリに興味がありません。

source: - You eschew complexity, favoring simple solutions.
ja: - 複雑さを嫌い、シンプルな解決法が好きです。

source: - You need clear, thorough documentation.
ja: - はっきりした、完璧なドキュメントが必要です。

source: - You need exceptional performance.
ja: - 優れた性能が必要です。

source: - You want a framework that requires nearly zero configuration.
ja: - ほぼゼロ構成で動くフレームワークが欲しいです。

source: - You want a framework with a small footprint.
ja: - 小さくて軽快なフレームワークを探しています。

source: - :doc:`License Agreement <license>` - :doc:`Change Log <changelog>`
ja: - :doc:`ライセンス契約 <license>` - :doc:`変更履歴 <changelog>`

source: - Autoloader - Logging - Exception Handling - HTTP Request/Response - Routing - Controllers - Models - Database (MySQL & Postgres) - Config - Security - Views - Sessions - Basic debugging and profiling
ja: - オートローダー - ログ - 例外処理 - HTTP リクエスト/レスポンス - ルーティング - コントローラー - モデル - データベース (MySQL と Postgres) - 設定 - セキュリティ - ビュー - セッション - 基本的なデバッグとプロファイリング

source: - FTP - XML-RPC - Zip - Typography - Template Parser
ja: - FTP - XML-RPC - Zip - タイポグラフィ - テンプレートパーサー

source: - The helpers - Language/Localization features - Caching - Email - Encryption - Form Validation - Image Library - Pagination - Uploader
ja: - ヘルパー - 言語/ローカライズ機能 - キャッシュ - メール機能 - 暗号化機能 - フォームバリデーション - イメージライブラリ - ページネーション - アップローダー

source: /Views Views make up the HTML that is displayed to the client.
ja: /Views ビューは、クライアントに表示されるHTMLを生成します。

source: /application /Config Stores the configuration files /Controllers Controllers determine the program flow /Helpers Helpers store collections of standalone functions /Language Multiple language support reads the language strings from here /Libraries Useful classes that don't fit in another category /Models Models work with the database to represent the business entities.
ja: /application /Config 設定ファイルを格納します。 /Controllers コントローラーはプログラムフローを決定します。 /Helpers ヘルパーは、独立型機能のコードを保存します /Language スタンドアロン関数のコレクションを格納するここで、複数言語サポート言語の文字列を読み取ります。 /Libraries Useful classes that don't fit in another category /Models Models work with the database to represent the business entities.

source: ===================== CodeIgniter4 Roadmap =====================
ja: ===================== CodeIgniter4 ロードマップ =====================

source: A fresh install has six directories: ``/application``, ``/system``, ``/public``, ``/writable``, ``/tests`` and ``/docs``.
ja: 新規インストールをすると6つのディレクトリができます。: ``/application``, ``/system``, ``/public``, ``/writable``, ``/tests`` and ``/docs``.

source: Abstractions ============
ja: 抽象化 ============

source: After the HTML has been built, each successive build will only rebuild files that have changed, saving considerable time.
ja: HTMLがビルドされると 変更されたファイルのみを再構築し かなりの時間を節約します。

source: All files in this directory live under the ``CodeIgniter`` namespace.
ja: このディレクトリ内のすべてのファイルは ``CodeIgniter`` の名前空間を持っています。

source: All of the source files exist under *source/* and is where you will add new documentation or modify existing documentation.
ja: すべてのソースファイルは *source/* 以下にあります。 新しいドキュメントを追加したり 既存のドキュメントの変更修正をする場所です。

source: As they get implemented and tested, and merged into the framework, they will show up in the changelog.
ja: 実装されテストされて、このフレームワークにマージされたものは、 変更履歴に表示されます。

source: At this point, the framework can be released and need not wait for these libraries to be brought up to date.
ja: フェーズ3になった時点で、CodeIgniterはリリースすることが可能な状態です。このフェーズのコードを待つ必要はありません。

source: Because the ``application`` directory is already namespaced, you should feel free to modify the structure of this directory to suit your application's needs.
ja: ``application`` ディレクトリはすでに名前空間の設定がされているため アプリケーションの必要に応じて、このディレクトリの構造は自由に変更できます。

source: Because they're all registered through `spl_autoload_register <http://php.net/manual/en/function.spl-autoload-register.php>`_, they work in sequence and don't get in each other's way.
ja: それらがすべては `spl_autoload_register <http://php.net/manual/en/function.spl-autoload-register.php>`_, を通じて登録されるので、それぞれがお互いを邪魔するといったことはありません。

source: Classmap ========
ja: クラスマップ ========

source: CodeIgniter is an Application Development Framework - a toolkit - for people who build web sites using PHP.
ja: CodeIgniterはPHPを使用してWebサイトを構築する人のための、 アプリケーション開発フレームワークです。

source: CodeIgniter is right for you if:
ja: 次の場合、CodeIgniterはあなたに向いています:

source: CodeIgniter lets you creatively focus on your project by minimizing the amount of code needed for a given task.
ja: CodeIgniterは、あなたがクリエイティブなタスクのため必要となるコードの量を最小限にすることによって、 あなたのプロジェクトに集中することができます。

source: CodeIgniter provides a very flexible autoloader that can be used with very little configuration.
ja: CodeIgniterは非常に柔軟なオートローダを提供し、とても小さな構成で使用することができます。

source: Command-Line Support ====================
ja: コマンドライン サポート ====================

source: Completed: June 2016
ja: 完了: 2016年6月

source: Configuration =============
ja: 設定 =============

source: Contents will settle
ja: いずれ落ち着きます。

source: Default Directories ===================
ja: デフォルトディレクトリ ===================

source: Dependencies ============
ja: 依存関係 ============

source: Developers will undoubtedly create their own as well.
ja: 開発者は間違いなく自分たちのためのアドオンを作ることでしょう。

source: Documentation =============
ja: ドキュメント =============

source: During this phase, we will be looking for PRs for the planned and approved components, and for bug reports filed as github issues.
ja: このフェーズでは、私たちが計画し承認したコンポーネントと githubのissueに対してのPRを求めています。

source: Each of these directories has a very specific part to play.
ja: これらのディレクトリはそれぞれ役割を持っています。.

source: Each optional package will have its own repository, and will be developed and managed independently of the main framework.
ja: 各オプションパッケージには独自のレポジトリを持つことになります。 メインのフレームワークとは独立して管理されます。

source: Editing and Creating Documentation ==================================
ja: ドキュメントの編集と作成 ==================================

source: Every application consists of a large number of classes in many different locations.
ja: すべてのアプリケーションは、さまざまな場所にたくさんのクラスで構成されています。

source: For example, you might decide to start using the Repository pattern and Entity Models to work with your data.
ja: たとえば、あなたはあなたのデータを操作するために リポジトリパターンとエンティティモデルの使用を開始することを決定するとします。

source: For performance improvement, the core CodeIgniter components have been added to the classmap.
ja: 性能向上のためにCodeIgniterのコアコンポーネントはクラスマップに追加されました。

source: From the root directory of your user guide repo fork issue the command you used at the end of the installation instructions::
ja: あなたのユーザガイドのルートディレクトリで インストール手順の最後に使用したコマンドを実行してください。

source: Generating the HTML is very simple.
ja: HTMLをビルドすることは とても簡単です。

source: HTMLドキュメントは、ユーザがまず目にするドキュメントであり、 私たちが最も気になるところです。Since revisions to the built files are not of value, they are not under source control.
ja: HTMLドキュメントは読点ユーザがまず目にするドキュメントであり、 私たちが最も気になるところですが ビルドファイルの履歴には価値がないためソース管理されません。

source: Handlers --------
ja: ハンドラー --------

source: If for any reason you want to "reset" your build files, simply delete the *build* folder's contents and rebuild.
ja: 何らかの理由でビルドファイルを "リセット" したい場合は *build* ディレクトリの中身を削除して再度ビルドしてください。

source: If you use double-quotes to define the array, be sure to escape the backwards slash.
ja: Iもしあなたがダブルクォートを使用する場合は バックスラッシュをエスケープするようにしてください。

source: If you're not on 2.7+, go ahead and install 2.7.2 from http://python.org/download/releases/2.7.2/
ja: あなたが2.7以上でないなら、次のURLから2.7.2をインストールしてください http://python.org/download/releases/2.7.2/

source: If you've relocated any of the main directories, you can let the application know the new location within the main ``index.php`` file.
ja: メインディレクトリを変更した場合、 ``index.php`` ファイルの中に新しい場所を指定することができます。

source: In short, CodeIgniter is the malleable framework that tries to provide the tools you need while staying out of the way.
ja: つまりCodeIgniterは あなたに必要なツールを提供する邪魔にならないフレームなのです。

source: In this case, you could rename the ``Models`` directory to ``Repositories``, and add a new ``Entities`` directory.
ja: その場合 ``Models`` の名前を ``Repositories`` に変更し、 新たに ``Entities`` ディレクトリを追加します。

source: Initial configuration is done in **/application/Config/Autoload.php**.
ja: 初期設定は **/application/Config/Autoload.php** で行われます。

source: Install `easy_install <http://peak.telecommunity.com/DevCenter/EasyInstall#installing-easy-install>`_ 2.
ja: `easy_install <http://peak.telecommunity.com/DevCenter/EasyInstall#installing-easy-install>`_ をインストール 2.

source: Install the CI Lexer which allows PHP, HTML, CSS, and JavaScript syntax highlighting in code examples (see *cilexer/README*) 5.
ja: CI Lexerをインストールすると PHP, HTML, CSS, と JavaScript を使った例文に対してシンタックスハイライトを使用することができます。 ( *cilexer/README* を参照) 5.

source: Installation ============
ja: インストール ============

source: Interfaces ----------
ja: インターフェイズ ----------

source: It can locate individual non-namespaced classes, namespaced classes that adhere to `PSR4 <http://www.php-fig.org/psr/psr-4/>`_ autoloading directory structures, and will even attempt to locate classes in common directories (like Controllers, Models, etc).
ja: これは名前空間があるもの、ないものについて `PSR4 <http://www.php-fig.org/psr/psr-4/>`_ のオートロードのディレクトリ構造で、 そして (コントローラ、モデルなど）共通ディレクトリ内の クラスを探します。

source: It contains the main **.htaccess** file, **index.php**, and any application assets that you add, like CSS, javascript, or images.
ja: これは **.htaccess** ファイル、メインとなる **index.php** 、 及びCSS, Javascriopt 画像などの任意のファイルを含みます。

source: It should load up and tell you which version you have installed.
ja: ロードし、 インストールしたバージョンを教えてください。

source: Its goal is to enable you to develop projects much faster than you could if you were writing code from scratch, by providing a rich set of libraries for commonly needed tasks, as well as a simple interface and logical structure to access these libraries.
ja: その目標は、 一般的に必要なライブラリが豊富だということだけではなくて ライブラリにアクセスするためのシンプルなインターフェイスと論理構造を提供し スクラッチからコードを書くよりもはるかに速く 開発できるようにすることです。

source: Just as with code changes, we recommend working from feature branches and making pull requests to the *develop* branch of this repo.
ja: コードの変更と同様に、 feature ブランチから作業し、 このレポジトリの *develop* ブランチにプルリクエストを行うことをお勧めします。

source: Keeping track of where every single file is, and hard-coding that location into your files in a series of ``requires()`` is a massive headache and very error-prone.
ja: すべてのファイルを使うために、すべてを 都度 ``requires()`` と、ハードコーディングすることは、エラーも発生しやすく、 頭の痛い作業です。

source: Legacy Support ==============
ja: レガシーサポート ==============

source: Modifying Directory Locations -----------------------------
ja: ディレクトリの場所の変更 -----------------------------

source: Namespaces ==========
ja: 名前空間 ==========

source: Namespaces and Files ====================
ja: 名前空間とファイル ====================

source: Obviously, the HTML documentation is what we care most about, as it is the primary documentation that our users encounter.
ja: HTMLドキュメントは、ユーザがまず目にするドキュメントであり、 私たちが最も気になるところです。

source: Pages are written in human-readable `ReStructured Text <http://sphinx.pocoo.org/rest.html>`_ format.
ja: ページは人間が読めるように `ReStructured Text <http://sphinx.pocoo.org/rest.html>`_ 形式で書かれています。

source: Phase 1 packages include:
ja: フェーズ 1 の機能は次の通りです:

source: Phase 1: Essentials (done) ==========================
ja: フェーズ 1: エッセンシャル (完了) ==========================

source: Phase 2 packages include:
ja: フェーズ2 の機能は次の通りです

source: Phase 2: Core Components (in progress) ======================================
ja: フェーズ 2: コアコンポーネント (進行中) ======================================

source: Phase 3: Expansion (not started) ================================
ja: フェーズ 3: 拡張機能 (未着手) ================================

source: Planned optional packages:
ja: オプションパッケージの予定:

source: Please refer to source/documentation/index.rst for general guidelines for using Sphinx to document CodeIgniter.
ja: Sphinxを使用してCodeIgniterを文書化する際の一般的なガイドラインについては source/documentation/index.rst を参照してください。

source: Prerequisites =============
ja: 前提条件 =============

source: Release Date: Not Released
ja: リリース日時: リリースされていません。

source: Results may not be as depicted.
ja: 描いているような結果が出ないかもしれません。

source: So where's the HTML?
ja: HTMLはどこにあるの？

source: Sphinx requires Python, which is already installed if you are running OS X. You can confirm in a Terminal window by executing the ``python`` command without any parameters.
ja: SphinxにはPythonが必要です。PythonはOS Xを利用している場合にはすでにインストールされています。 ``python`` コマンドをパラメータなしで実行すると、 ターミナルで確認できます

source: Target completion: April 2017
ja: 完成目標: 2017年4月

source: Target completion: December 2016
ja: 完成目標: 2016年12月

source: That's where autoloaders come in.
ja: そこで、オートローダの出番です。

source: The **public** folder holds the browser-acceible portion of your web application, preventing direct access to your source code.
ja: **public** フォルダは、ソースコードへの直接アクセスを防止し ブラウザからアクセス可能なものを格納します。

source: The CodeIgniter user guide uses Sphinx to manage the documentation and output it to various formats.
ja: CodeIgniterユーザガイドでは、Sphinxを使用して さまざまな形式のドキュメントとして出力します。

source: The ``_support`` directory holds various mock classes and other utilities that you can use while writing your tests.
ja: ``_support`` ディレクトリにはテストを書くときに使用するモッククラス やユーティリティを保存できます。

source: The ``psr4`` array in the configuration file allows you to map the namespace to the directory those classes can be found in::
ja: 設定ファイルの中の ``psr4`` 配列を利用すると、それらのクラスを見つけることができるディレクトリに対して 名前空間をマッピングすることができます::

source: The ``user_guide`` subfolder contains a local copy of the User Guide, and the ``api_docs`` subfolder contains a local copy of the CodeIgniter components API reference.
ja: ``user_guide`` フォルダにはローカルコピーが含まれており、 ``api_docs`` フォルダにはCodeIgniterコンポーネントAPIリファレンスのローカルコピーが含まれています。

source: The autoloader is always active, being registered with ``spl_autoload_register()`` at the beginning of the framework's execution.
ja: オートローダーはフレームワークの実行開始時に ``spl_autoload_register()`` に登録され 常にアクティブです。

source: The autoloader works great by itself, but can also work with other autoloaders, like `Composer <https://getcomposer.org>`_, or even your own custom autoloaders, if needed.
ja: オートローダはそれだけでも機能しますが、必要に応じて他のオートローダや `Composer <https://getcomposer.org>`_ や独自のカスタムオートローダを使用することもできます。

source: The first phase focused on nailing the essentials in the framework.
ja: 最初のフェーズではフレームワークの本質に対して集中しました。

source: The following folders make up the basic contents::
ja: 次のフォルダは、基本的な内容を作ります:

source: The following pages describe the architectural concepts behind CodeIgniter4:
ja: 次のページではCodeIgniter4の背景になる構造上の概念について説明します。:

source: The framework can have core parts easily extended or completely replaced to make the system work the way you need it to.
ja: フレームワークは、コアの部分を簡単に拡張したり、 必要とする機能のために差し替えることができます。

source: The framework provides classes for core functionality.
ja: このフレームワークは、コア機能の提供するクラスを提供します。

source: The key of each row is the namespace itself.
ja: 各行の配列のキーは名前空間そのものを表します。

source: The recommended method for organizing your classes is to create one or more namespaces for your application's files.
ja: クラスを整理するために、アプリケーションのファイルのために1つもしくは複数の 名前空間を作成することをお勧めします。

source: The roadmap we are working to was `announced on our forum <http://forum.codeigniter.com/thread-62615.html>`_ in August, 2015.
ja: 私たちが取り組んでいるロードマップは、2005年8月に `フォーラム <http://forum.codeigniter.com/thread-62615.html>`_ で発表されました。

source: The second phase focuses on providing and refining the existing classes and features that CodeIgniter users know and love.
ja: 次のフェーズでは、既存クラスのとCodeIgniterユーザーが好むであろう機能について 洗練することに集中しました。

source: The third phase includes fleshing out and working on the optional packages.
ja: ３つ目のフェーズでは、オプション的なパッケージに取り組みます。

source: The value is the location to the directory the classes can be found in.
ja: この値は、クラスを見つかることができるディレクトリの場所です。

source: These optional packages will constitute the "official" addins for CodeIgniter4.
ja: オプションパッケージは CodeIgniter4 のための公式なアドオンを構成します。

source: These paths are relative to **index.php**.
ja: これらのパスは **index.php** を基準にしています。

source: This also allows you to regenerate as necessary if you want to "preview" your work.
ja: そのため それらを表示をしたい場合にはソースコードからビルドします。

source: This comes with a default directory structure that works well for many applications.
ja: デェフォルトのディレクトリ構造は 多くのアプリケーションに適しています。

source: This directory does not need to be transferred to your production servers.
ja: このディレクトリは本番サーバに転送する 必要はありません。

source: This does not need a trailing slash.
ja: 末尾にバックスラッシュは必要ありません。

source: This ensures that all of the basic parts needed to make it work are in place and working well.
ja: 動作させるために飛鳥な基本的な部分が適切に配置され、 うまく機能していることを保証します。

source: This file contains two primary arrays: one for the classmap, and one for PSR4-compatible namespaces.
ja: このファイルには主要な2つの配列が含まれています。 1つはクラスマップに対して、もう1つはPSR4互換名前空間に対するものです。

source: This folder is meant to be the "web root" of your site, and your web server would be configured to point to it.
ja: このフォルダはサイトの "web ルート" であることを意味し、 Webサーバをそうなるように設定することになります。

source: This guide should help contributors understand how the core of the framework works, and what needs to be done when creating new functionality.
ja: このガイドでは、フレームワークのコアがどのように機能するか。 新しい機能を作成する際に何が必要なのかを理解するのに役立ちます。

source: This includes directories for storing cache files, logs, and any uploads a user might send.
ja: これは、キャッシュファイル、ログ、およびユーザが送信する可能性のある任意のアップロードを格納するためのディレクトリが含まれています。

source: This is most important for any business-logic related classes, entity classes, etc.
ja: これは、エンティティクラスやビジネスロジックに関連するクラスのために 最も重要なことです。.

source: This phase is complete, and the repository is being opened up for the community to help.
ja: このフェーズが完了し、レポジトリーは コミュニティのために公開されました。

source: To get the most out of CodeIgniter, you need to understand how the application is structured, by default, and what you can change to meet the needs of your application.
ja: CodeIgniterを最大限に利用するために, アプリケーションの構造とデフォルト、そして変更できることについて理解する必要があります。

source: Type hinting ============
ja: タイプヒンティング ============

source: We have not settled on the best way to promote/integrate these.
ja: 私たちは 促進し、統合する 良い方法について、解決することができていません。

source: Where possible, CodeIgniter has been kept as flexible as possible, allowing you to work in the way you want, not being forced into working any certain way.
ja: CodeIgniterはできる限り柔軟になっています。 利用方法が特定のルールに 縛られることはありません。

source: While you have a lot of flexibility in how you use the application directory, the files in the system directory should never be modified.
ja: アプリケーションディレクトリを使用する場合多くの柔軟性を持っていますが、 システムディレクトリ内のファイルを変更することはありません。

source: You might have third-party classes that your project is using.
ja: プロジェクトで利用されている サードパーティなクラスも利用しているはずです。

source: You should add any other directories that your application will need to write to here.
ja: アプリケーションはここに書き込む必要がある 他のディレクトリを追加する必要があります。

source: You will see it do a whiz-bang compilation, at which point the fully rendered user guide and images will be in *build/html/*.
ja: 素晴らしく完璧にレンダリングされたユーザーガイドとその画像は *build/html/* の中に保存されます。

source: Your application will have a number of libraries, models, and other entities to make it work.
ja: あなたのアプリケーションは 動作させるために、ライブラリ、モデル、およびその他多くものを持つことになります。

source: Your mileage may vary.
ja: 結果はあなたの思惑とは違うかもしれません。

source: application ----------- The ``application`` directory is where all of your application code lives.
ja: application ----------- ``application`` のディレクトリはアプリケーションのすべてのコードが存在します。

source: docs ---- This directory holds the CodeIgniter documentation.
ja: docs ---- このディレクトリは、CodeIgniterのドキュメントが保存されています。

source: during shipping.
ja: 開発は進んでいるのですから。

source: note:: Any target completion dates shown are speculative, and depend
ja: 注意::提示した目標完了日は推測にです。

source: system ------ This directory stores the files that make up the framework, itself.
ja: system ------ このディレクトリには、フレームワークを構成するファイルを格納します。

source: tests ----- This directory is setup to hold your test files.
ja: tests ----- このディレクトリにはテストファイルを保存するように設定されています。

source: very much on the quantity and quality of community contributions.
ja: コミュニティの貢献の量と質から、とても大きく影響されます。

source: writable -------- This directory holds any directories that might need to be written to in the course of an application's life.
ja: writable -------- このディレクトリはアプリケーションの中で書き込みが必要なファイルを保存しておくことができます。
